Функция СоответствиеМассивовПоТипамОбъектов(МассивСсылок) Экспорт
	
	СоответствиеТипов = Новый Соответствие;
	
	Для Каждого Объект1 Из МассивСсылок Цикл
		
		ТипОбъекта = Объект1.Метаданные().ПолноеИмя();
		ТекущийТипОбъекта = СоответствиеТипов.Получить(ТипОбъекта); // Массив - 
		
		Если ТекущийТипОбъекта = Неопределено Тогда
			СоответствиеТипов.Вставить(ТипОбъекта, Новый Массив);
			ТекущийТипОбъекта = СоответствиеТипов.Получить(ТипОбъекта);
		КонецЕсли;
		ТекущийТипОбъекта.Добавить(Объект);
		
	КонецЦикла;
	
	Возврат СоответствиеТипов;
	
КонецФункции



&НаСервере
Процедура СформироватьОтчетНаСервере()
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	ТабДок.Очистить();
	МассивДок = Новый Массив;
	МассивДок.Добавить(ЗаказКлиента.Ссылка);
	//ОбщегоНазначенияУНФКлиентСервер
	СтруктураТипов = СоответствиеМассивовПоТипамОбъектов(МассивДок);
	МассивДок = Новый СписокЗначений;//Массив;
	МассивДок.Добавить(ЗаказКлиента.Ссылка);

	ПараметрыПечати = Новый Структура();
	////ВыводитьКартинку
	////ВыводитьФаксимиле
	////ВыводитьШК
	Если ВыводитьФаксимиле Тогда
		ПараметрыПечати.Вставить("ОтображатьФаксимиле", Истина);
	иначе
		ПараметрыПечати.Вставить("ОтображатьФаксимиле", Ложь);
	КонецЕсли;
	Если ВыводитьШК Тогда
		ПараметрыПечати.Вставить("КолонкаШтрихкоды", Истина);
	иначе
		ПараметрыПечати.Вставить("КолонкаШтрихкоды", Ложь);
	КонецЕсли;
	Если ВыводитьКартинку Тогда
		ПараметрыПечати.Вставить("КолонкаЭскиз", Истина);
	иначе
		ПараметрыПечати.Вставить("КолонкаЭскиз", Ложь);
	КонецЕсли;
	ВывестиПланОплаты = Истина;
	ТабДок.Вывести(ОтчетОбъект.СформироватьПФ(МассивДок, ВывестиПланОплаты));
	
КонецПроцедуры // СформироватьОтчетНаСервере()()

&НаКлиенте
Процедура ПечатьЗаказа(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры
